# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# RT-DETR with ResNet-18-style backbone (basic blocks, e=1)
# Single-channel SAR input is supported by setting c1=1 in the stem.

# Parameters
nc: 80 # number of classes
scales:
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ResNetLayer, [1, 64, 1, True, 1, 1]] # 0 (stem)
  - [-1, 1, ResNetLayer, [64, 64, 1, False, 2, 1]] # 1
  - [-1, 1, ResNetLayer, [64, 128, 2, False, 2, 1]] # 2
  - [-1, 1, ResNetLayer, [128, 256, 2, False, 2, 1]] # 3
  - [-1, 1, ResNetLayer, [256, 512, 2, False, 2, 1]] # 4

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 5
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]] # 7

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 9
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]] # 11
  - [-1, 1, Conv, [256, 1, 1]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 14
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]] # 16

  - [-1, 1, Conv, [256, 3, 2]] # 17
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]] # 19

  - [-1, 1, Conv, [256, 3, 2]] # 20
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]] # 22

  - [[16, 19, 22], 1, RTDETRDecoder, [nc]] # Detect(P3, P4, P5)

